int main() {
    // Матрица от букви
    char strings[20][20];

    // Същото като горното - матрица или масив от букви
    char strings[20 * 20];

    // 1. Низ
    // 2. Масив от букви
    // 3. Указател към една буква
    char* strings;

    // 1. Масив от указатели към единични букви
    // 2. Масив от указатели към низове
    char* strings[20];

    // 1. Указател към указател към буква
    // 2. Указател към указател към масив
    // 3. Указател към масив с указатели към букви
    // 4. Указател към масив с указатели към масиви
    // 5. Масив от указатели към букви
    // 6. Масив от указатели към масиви от букви
    char** strings;

    return 0;
}
